cmsis-svd/cmsis-svd/data/Infineon/s6e2gmxj.svd
        <!-- REGISTER "EP0DT" -->
        <register>
          <name>EP0DT</name>
          <description>EP0 Data Register</description>
          <addressOffset>0x60</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0x0000</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "BFDT" -->
            <field>
              <name>BFDT</name>
              <description>Endpoint Send/Receive Buffer Data</description>
              <msb>15</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "EP1DT" -->
        <register derivedFrom="EP0DT">
          <name>EP1DT</name>
          <description>EP1 Data Register</description>
          <addressOffset>0x64</addressOffset>
        </register>
        <!-- REGISTER "EP2DT" -->
        <register derivedFrom="EP0DT">
          <name>EP2DT</name>
          <description>EP2 Data Register</description>
          <addressOffset>0x68</addressOffset>
        </register>
        <!-- REGISTER "EP3DT" -->
        <register derivedFrom="EP0DT">
          <name>EP3DT</name>
          <description>EP3 Data Register</description>
          <addressOffset>0x6C</addressOffset>
        </register>
        <!-- REGISTER "EP4DT" -->
        <register derivedFrom="EP0DT">
          <name>EP4DT</name>
          <description>EP4 Data Register</description>
          <addressOffset>0x70</addressOffset>
        </register>
        <!-- REGISTER "EP5DT" -->
        <register derivedFrom="EP0DT">
          <name>EP5DT</name>
          <description>EP5 Data Register</description>
          <addressOffset>0x74</addressOffset>
        </register>
      </registers>
    </peripheral>
    <!-- PERIPHERAL "USB1" -->
    <peripheral derivedFrom="USB0">
      <name>USB1</name>
      <baseAddress>0x40052100</baseAddress>
      <description>USB1 Function</description>
      <version>A</version>
      <!-- INTERRUPT "USB1_F" -->
      <interrupt>
        <name>USB1_F</name>
        <value>113</value>
      </interrupt>
      <!-- INTERRUPT "USB1_H_F" -->
      <interrupt>
        <name>USB1_H_F</name>
        <value>114</value>
      </interrupt>
    </peripheral>
    <!-- PERIPHERAL "DMAC" -->
    <peripheral>
      <name>DMAC</name>
      <description>DMAC Registers</description>
      <version>A</version>
      <groupName>DMAC</groupName>
      <baseAddress>0x40060000</baseAddress>
      <!-- ADDRESS BLOCK -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x10</offset>
        <size>0x80</size>
        <usage>registers</usage>
      </addressBlock>
      <!-- INTERRUPT "DMAC0" -->
      <interrupt>
        <name>DMAC0</name>
        <value>83</value>
      </interrupt>
      <!-- INTERRUPT "DMAC1" -->
      <interrupt>
        <name>DMAC1</name>
        <value>84</value>
      </interrupt>
      <!-- INTERRUPT "DMAC2" -->
      <interrupt>
        <name>DMAC2</name>
        <value>85</value>
      </interrupt>
      <!-- INTERRUPT "DMAC3" -->
      <interrupt>
        <name>DMAC3</name>
        <value>86</value>
      </interrupt>
      <!-- INTERRUPT "DMAC4" -->
      <interrupt>
        <name>DMAC4</name>
        <value>87</value>
      </interrupt>
      <!-- INTERRUPT "DMAC5" -->
      <interrupt>
        <name>DMAC5</name>
        <value>88</value>
      </interrupt>
      <!-- INTERRUPT "DMAC6" -->
      <interrupt>
        <name>DMAC6</name>
        <value>89</value>
      </interrupt>
      <!-- INTERRUPT "DMAC7" -->
      <interrupt>
        <name>DMAC7</name>
        <value>90</value>
      </interrupt>
      <!-- REGISTERS -->
      <registers>
        <!-- REGISTER "DMACR" -->
        <register>
          <name>DMACR</name>
          <description>Entire DMAC Configuration Register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xDF000000</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "DE" -->
            <field>
              <name>DE</name>
              <description>DMA Enable (all-channel operation enable bit) </description>
              <msb>31</msb>
              <lsb>31</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DS" -->
            <field>
              <name>DS</name>
              <description>DMA Stop</description>
              <msb>30</msb>
              <lsb>30</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PR" -->
            <field>
              <name>PR</name>
              <description>Priority Rotation</description>
              <msb>28</msb>
              <lsb>28</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DH" -->
            <field>
              <name>DH</name>
              <description>DMA Halt (All-channel pause bit) </description>
              <msb>27</msb>
              <lsb>24</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "DMACA0" -->
        <register>
          <name>DMACA0</name>
          <description>Configuration A Register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFF9FFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "EB" -->
            <field>
              <name>EB</name>
              <description>Enable bit (individual-channel operation enable bit)</description>
              <msb>31</msb>
              <lsb>31</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PB" -->
            <field>
              <name>PB</name>
              <description>Pause bit (individual-channel pause bit) </description>
              <msb>30</msb>
              <lsb>30</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ST" -->
            <field>
              <name>ST</name>
              <description>Software Trigger</description>
              <msb>29</msb>
              <lsb>29</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "IS" -->
            <field>
              <name>IS</name>
              <description>Input Select </description>
              <msb>28</msb>
              <lsb>23</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BC" -->
            <field>
              <name>BC</name>
              <description>Block Count </description>
              <msb>19</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TC" -->
            <field>
              <name>TC</name>
              <description>Transfer Count</description>
              <msb>15</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "DMACB0" -->
        <register>
          <name>DMACB0</name>
          <description>Configuration B Register</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x3FFF0001</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "MS" -->
            <field>
              <name>MS</name>
              <description>Mode Select</description>
              <msb>29</msb>
              <lsb>28</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TW" -->
            <field>
              <name>TW</name>
              <description>Transfer Width </description>
              <msb>27</msb>
              <lsb>26</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FS" -->
            <field>
              <name>FS</name>
              <description>Fixed Source </description>
              <msb>25</msb>
              <lsb>25</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FD" -->
            <field>
              <name>FD</name>
              <description>Fixed Destination</description>
              <msb>24</msb>
              <lsb>24</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RC" -->
            <field>
              <name>RC</name>
              <description>Reload Count (BC/TC reload)</description>
              <msb>23</msb>
              <lsb>23</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RS" -->
            <field>
              <name>RS</name>
              <description>Reload Source</description>
              <msb>22</msb>
              <lsb>22</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RD" -->
            <field>
              <name>RD</name>
              <description>Reload Destination</description>
              <msb>21</msb>
              <lsb>21</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EI" -->
            <field>
              <name>EI</name>
              <description>Error Interrupt (unsuccessful transfer completion interrupt enable)</description>
              <msb>20</msb>
              <lsb>20</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CI" -->
            <field>
              <name>CI</name>
              <description>Completion Interrupt (successful transfer completion interrupt enable)</description>
              <msb>19</msb>
              <lsb>19</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SS" -->
            <field>
              <name>SS</name>
              <description>Stop Status (stop status notification)</description>
              <msb>18</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EM" -->
            <field>
              <name>EM</name>
              <description>Enable bit Mask (EB bit clear mask)</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "DMACSA0" -->
        <register>
          <name>DMACSA0</name>
          <description>Transfer Source Address Register</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "DMACDA0" -->
        <register>
          <name>DMACDA0</name>
          <description>Transfer Destination Address Register</description>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "DMACA1" -->
        <register derivedFrom="DMACA0">
          <name>DMACA1</name>
          <description>Configuration A Register 1</description>
          <addressOffset>0x20</addressOffset>
        </register>
        <!-- REGISTER "DMACB1" -->
        <register derivedFrom="DMACB0">
          <name>DMACB1</name>
          <description>Configuration B Register 1</description>
          <addressOffset>0x24</addressOffset>
        </register>
        <!-- REGISTER "DMACSA1" -->
        <register derivedFrom="DMACSA0">
          <name>DMACSA1</name>
          <description>Transfer Source Address Register 1</description>
          <addressOffset>0x28</addressOffset>
        </register>
