cmsis-svd/cmsis-svd/data/Infineon/s6e2gmxj.svd
        <!-- REGISTER "MAR0H" -->
        <register>
          <name>MAR0H</name>
          <description>MAC Address0 Register (High)</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x8000FFFF</resetValue>
          <resetMask>0x8000FFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "MO" -->
            <field>
              <name>MO</name>
              <description>Must be one</description>
              <msb>31</msb>
              <lsb>31</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "A0" -->
            <field>
              <name>A0</name>
              <description>MAC Address0</description>
              <msb>15</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "MAR0L" -->
        <register>
          <name>MAR0L</name>
          <description>MAC Address0 Register (Low)</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "A0" -->
            <field>
              <name>A0</name>
              <description>MAC Address0</description>
              <msb>31</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "MAR1H" -->
        <register>
          <name>MAR1H</name>
          <description>MAC Address1 Register -High</description>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0000FFFF</resetValue>
          <resetMask>0xFF00FFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "AE" -->
            <field>
              <name>AE</name>
              <description>Address Enable</description>
              <msb>31</msb>
              <lsb>31</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SA" -->
            <field>
              <name>SA</name>
              <description>Source Address</description>
              <msb>30</msb>
              <lsb>30</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MBC" -->
            <field>
              <name>MBC</name>
              <description>Mask Byte Control</description>
              <msb>29</msb>
              <lsb>24</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "A" -->
            <field>
              <name>A</name>
              <description>MAC Address</description>
              <msb>15</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "MAR1L" -->
        <register>
          <name>MAR1L</name>
          <description>MAC Address1 Register -Low</description>
          <addressOffset>0x4C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "A" -->
            <field>
              <name>A</name>
              <description>MAC Address</description>
              <msb>31</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "MAR2H" -->
        <register derivedFrom="MAR1H">
          <name>MAR2H</name>
          <description>MAC Address2 Register -High</description>
          <addressOffset>0x50</addressOffset>
        </register>
        <!-- REGISTER "MAR2L" -->
        <register derivedFrom="MAR1L">
          <name>MAR2L</name>
          <description>MAC Address2 Register -Low</description>
          <addressOffset>0x54</addressOffset>
        </register>
        <!-- REGISTER "MAR3H" -->
        <register derivedFrom="MAR1H">
          <name>MAR3H</name>
          <description>MAC Address3 Register -High</description>
          <addressOffset>0x58</addressOffset>
        </register>
        <!-- REGISTER "MAR3L" -->
        <register derivedFrom="MAR1L">
          <name>MAR3L</name>
          <description>MAC Address3 Register -Low</description>
          <addressOffset>0x5C</addressOffset>
        </register>
        <!-- REGISTER "MAR4H" -->
        <register derivedFrom="MAR1H">
          <name>MAR4H</name>
          <description>MAC Address4 Register -High</description>
          <addressOffset>0x60</addressOffset>
        </register>
        <!-- REGISTER "MAR4L" -->
        <register derivedFrom="MAR1L">
          <name>MAR4L</name>
          <description>MAC Address4 Register -Low</description>
          <addressOffset>0x64</addressOffset>
        </register>
        <!-- REGISTER "MAR5H" -->
        <register derivedFrom="MAR1H">
          <name>MAR5H</name>
          <description>MAC Address5 Register -High</description>
          <addressOffset>0x68</addressOffset>
        </register>
        <!-- REGISTER "MAR5L" -->
        <register derivedFrom="MAR1L">
          <name>MAR5L</name>
          <description>MAC Address5 Register -Low</description>
          <addressOffset>0x6C</addressOffset>
        </register>
        <!-- REGISTER "MAR6H" -->
        <register derivedFrom="MAR1H">
          <name>MAR6H</name>
          <description>MAC Address6 Register -High</description>
          <addressOffset>0x70</addressOffset>
        </register>
