cmsis-svd/cmsis-svd/data/Infineon/s6e2gmxj.svd
        <!-- REGISTER "MAR30L" -->
        <register derivedFrom="MAR1L">
          <name>MAR30L</name>
          <description>MAC Address30 Register -Low</description>
          <addressOffset>0x874</addressOffset>
        </register>
        <!-- REGISTER "MAR31H" -->
        <register derivedFrom="MAR1H">
          <name>MAR31H</name>
          <description>MAC Address31 Register -High</description>
          <addressOffset>0x878</addressOffset>
        </register>
        <!-- REGISTER "MAR31L" -->
        <register derivedFrom="MAR1L">
          <name>MAR31L</name>
          <description>MAC Address31 Register -Low</description>
          <addressOffset>0x87C</addressOffset>
        </register>
        <!-- REGISTER "BMR" -->
        <register>
          <name>BMR</name>
          <description>Bus Mode Register</description>
          <addressOffset>0x1000</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00020101</resetValue>
          <resetMask>0x0FFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TXPR" -->
            <field>
              <name>TXPR</name>
              <description>Transmit Priority</description>
              <msb>27</msb>
              <lsb>27</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MB" -->
            <field>
              <name>MB</name>
              <description>Mixed Burst</description>
              <msb>26</msb>
              <lsb>26</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AAL" -->
            <field>
              <name>AAL</name>
              <description>Address-Aligned Beats</description>
              <msb>25</msb>
              <lsb>25</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "_8XPBL" -->
            <field>
              <name>_8XPBL</name>
              <description>8xPBL Mode</description>
              <msb>24</msb>
              <lsb>24</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "USP" -->
            <field>
              <name>USP</name>
              <description>Use Separate PBL</description>
              <msb>23</msb>
              <lsb>23</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RPBL" -->
            <field>
              <name>RPBL</name>
              <description>RxDMA PBL</description>
              <msb>22</msb>
              <lsb>17</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FB" -->
            <field>
              <name>FB</name>
              <description>Fixed Burst</description>
              <msb>16</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PR" -->
            <field>
              <name>PR</name>
              <description>Rx:Tx priority ratio</description>
              <msb>15</msb>
              <lsb>14</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PBL" -->
            <field>
              <name>PBL</name>
              <description>Programmable Burst Length</description>
              <msb>13</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ATDS" -->
            <field>
              <name>ATDS</name>
              <description>Alternate Descriptor Size</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DSL" -->
            <field>
              <name>DSL</name>
              <description>Descriptor Skip Length</description>
              <msb>6</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DA" -->
            <field>
              <name>DA</name>
              <description>DMA Arbitration scheme</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SWR" -->
            <field>
              <name>SWR</name>
              <description>Software Reset</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "TPDR" -->
        <register>
          <name>TPDR</name>
          <description>Transmit Poll Demand Register)</description>
          <addressOffset>0x1004</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TPD" -->
            <field>
              <name>TPD</name>
              <description>Transmit Poll Demand</description>
              <msb>31</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "RPDR" -->
        <register>
          <name>RPDR</name>
          <description>Receive Poll Demand Register</description>
          <addressOffset>0x1008</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "RPD" -->
            <field>
              <name>RPD</name>
              <description>Receive Poll Demand</description>
              <msb>31</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "RDLAR" -->
        <register>
          <name>RDLAR</name>
          <description>Receive Descriptor List Address Register)</description>
          <addressOffset>0x100C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFC</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SRL" -->
            <field>
              <name>SRL</name>
              <description>Start of Receive List</description>
              <msb>31</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "TDLAR" -->
        <register>
          <name>TDLAR</name>
          <description> Transmit Descriptor List Address Register</description>
          <addressOffset>0x1010</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFC</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "STL" -->
            <field>
              <name>STL</name>
              <description>Start of Transmit List</description>
              <msb>31</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "SR" -->
        <register>
          <name>SR</name>
          <description>Status Register</description>
          <addressOffset>0x1014</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x7FFFE7FF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "GLPII" -->
            <field>
              <name>GLPII</name>
              <description>GMAC LPI Interrupt</description>
              <msb>30</msb>
              <lsb>30</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TTI" -->
            <field>
              <name>TTI</name>
              <description>Time-Stamp Trigger Interrupt</description>
              <msb>29</msb>
              <lsb>29</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "GPI" -->
            <field>
              <name>GPI</name>
              <description>GMAC PMT Interrupt</description>
              <msb>28</msb>
              <lsb>28</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "GMI" -->
            <field>
              <name>GMI</name>
              <description>GMAC MMC Interrupt</description>
              <msb>27</msb>
              <lsb>27</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "GLI" -->
            <field>
              <name>GLI</name>
              <description>GMAC Line interface Interrupt</description>
              <msb>26</msb>
              <lsb>26</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "EB" -->
            <field>
              <name>EB</name>
              <description>Error Bits</description>
              <msb>25</msb>
              <lsb>23</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TS" -->
            <field>
              <name>TS</name>
              <description>Transmit Process State</description>
              <msb>22</msb>
              <lsb>20</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "RS" -->
            <field>
              <name>RS</name>
              <description>Receive Process State</description>
              <msb>19</msb>
              <lsb>17</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "NIS" -->
            <field>
              <name>NIS</name>
              <description>Normal Interrupt Summary</description>
              <msb>16</msb>
              <lsb>16</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "AIS" -->
            <field>
              <name>AIS</name>
              <description>Abnormal Interrupt Summary</description>
              <msb>15</msb>
              <lsb>15</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "ERI" -->
            <field>
              <name>ERI</name>
              <description>Early Receive Interrupt</description>
              <msb>14</msb>
              <lsb>14</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "FBI" -->
            <field>
              <name>FBI</name>
              <description>Fatal Bus Error Interrupt</description>
              <msb>13</msb>
              <lsb>13</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "ETI" -->
            <field>
              <name>ETI</name>
              <description>Early Transmit Interrupt</description>
              <msb>10</msb>
              <lsb>10</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "RWT" -->
            <field>
              <name>RWT</name>
              <description>Receive Watchdog Timeout</description>
              <msb>9</msb>
              <lsb>9</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "RPS" -->
            <field>
              <name>RPS</name>
              <description>Receive process Stopped</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "RU" -->
            <field>
              <name>RU</name>
              <description>Receive Buffer Unavailable</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "RI" -->
            <field>
              <name>RI</name>
              <description>Receive Interrupt</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "UNF" -->
            <field>
              <name>UNF</name>
              <description>Transmit underflow</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "OVF" -->
            <field>
              <name>OVF</name>
              <description>Receive Overflow</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TJT" -->
            <field>
              <name>TJT</name>
              <description>Transmit Jabber Timeout</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TU" -->
            <field>
              <name>TU</name>
              <description>Transmit Buffer Unavailable</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TPS" -->
            <field>
              <name>TPS</name>
              <description>Transmit Process Stopped</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TI" -->
            <field>
              <name>TI</name>
              <description>Transmit Interrupt</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "OMR" -->
        <register>
          <name>OMR</name>
          <description>Operation Mode Register</description>
          <addressOffset>0x1018</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0731E0DE</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "DT" -->
            <field>
              <name>DT</name>
              <description>Disable Dropping of TCP/IP Checksum Error Frames</description>
              <msb>26</msb>
              <lsb>26</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RSF" -->
            <field>
              <name>RSF</name>
              <description>Receive Store and Forward</description>
              <msb>25</msb>
              <lsb>25</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DFF" -->
            <field>
              <name>DFF</name>
              <description>Disable Flushing of Received Frames</description>
              <msb>24</msb>
              <lsb>24</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TSF" -->
            <field>
              <name>TSF</name>
              <description>Transmit Store Forward</description>
              <msb>21</msb>
              <lsb>21</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FTF" -->
            <field>
              <name>FTF</name>
              <description>Flush Transmit FIFO</description>
              <msb>20</msb>
              <lsb>20</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TTC" -->
            <field>
              <name>TTC</name>
              <description>Transmit Threshold Control</description>
              <msb>16</msb>
              <lsb>14</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ST" -->
            <field>
              <name>ST</name>
              <description>Start/Stop Transmission Command</description>
              <msb>13</msb>
              <lsb>13</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FEF" -->
            <field>
              <name>FEF</name>
              <description>Forward Error Frames</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FUF" -->
            <field>
              <name>FUF</name>
              <description>Forward Undersized Good Frames</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RTC" -->
            <field>
              <name>RTC</name>
              <description>Receive Threshold Control</description>
              <msb>4</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "OSF" -->
            <field>
              <name>OSF</name>
              <description>Operate on Second Frame</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SR" -->
            <field>
              <name>SR</name>
              <description>Start/Stop Receive</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IER" -->
        <register>
          <name>IER</name>
          <description>Interrupt Enable Register</description>
          <addressOffset>0x101C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0001E7FF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "NIE" -->
            <field>
              <name>NIE</name>
              <description>Normal Interrupt Summary Enable</description>
              <msb>16</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AIE" -->
            <field>
              <name>AIE</name>
              <description>Abnormal Interrupt Summary Enable</description>
              <msb>15</msb>
              <lsb>15</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ERE" -->
            <field>
              <name>ERE</name>
              <description>Early Receive Interrupt Enable</description>
              <msb>14</msb>
              <lsb>14</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FBE" -->
            <field>
              <name>FBE</name>
              <description>Fatal Bus Error Enable</description>
              <msb>13</msb>
              <lsb>13</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ETE" -->
            <field>
              <name>ETE</name>
              <description>Early Transmit Interrupt Enable</description>
              <msb>10</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RWE" -->
            <field>
              <name>RWE</name>
              <description>Receive Watchdog Timeout Enable</description>
              <msb>9</msb>
              <lsb>9</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RSE" -->
            <field>
              <name>RSE</name>
              <description>Receive Process Stopped Enable</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RUE" -->
            <field>
              <name>RUE</name>
              <description>Receive Buffer Unavailable Enable</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RIE" -->
            <field>
              <name>RIE</name>
              <description>Receive Interrupt Enable</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UNE" -->
            <field>
              <name>UNE</name>
              <description>Transmit underflow Enable</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "OVE" -->
            <field>
              <name>OVE</name>
              <description>Receive Overflow Enable</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TJE" -->
            <field>
              <name>TJE</name>
              <description>Transmit Jabber Timeout</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TUE" -->
            <field>
              <name>TUE</name>
              <description>Transmit Buffer Unavailable</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TSE" -->
            <field>
              <name>TSE</name>
              <description>Transmit Process Stopped</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIE" -->
            <field>
              <name>TIE</name>
              <description>Transmit Interrupt</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
